# Bank Market Analysis



There has been a revenue decline for the Portuguese bank and they would like to know what actions to take. After investigation, we found out that the root cause is that their clients are not depositing as frequently as before. Knowing that term deposits allow banks to hold onto a deposit for a specific amount of time, so banks can invest in higher gain financial products to make a profit. In addition, banks also hold better chance to persuade term deposit clients into buying other products such as funds or insurance to further increase their revenues. As a result, the Portuguese bank would like to identify existing clients that have higher chance to subscribe for a term deposit and focus marketing effort on such clients. In this code along we are doing the data analysis using the pandas.


## Understanding the dataset

**Data Set Information**

The data is related to direct marketing campaigns of a Portuguese banking institution. The marketing campaigns were based on phone calls. Often, more than one contact to the same client was required, in order to access if the product (bank term deposit) would be ('yes') or not ('no') subscribed.
There are four datasets:
bank-additional-full.csv with all examples (41188) and 20 inputs, ordered by date (from May 2008 to November 2010), very close to the data analyzed in [Moro et al., 2014]
bank-additional.csv with 10% of the examples (4119), randomly selected from 1), and 20 inputs.
bank-full.csv with all examples and 17 inputs, ordered by date (older version of this dataset with fewer inputs).
bank.csv with 10% of the examples and 17 inputs, randomly selected from 3 (older version of this dataset with fewer inputs). The smallest datasets are provided to test more computationally demanding machine learning algorithms 
Goal:- The classification goal is to predict if the client will subscribe (yes/no) a term deposit (variable y).

**Features**

|Feature|Feature_Type|Description|
|-----|-----|-----|
|age|numeric|age of a person|  
|job |Categorigol,nominal|type of job ('admin.','blue-collar','entrepreneur','housemaid','management','retired','self-employed','services','student','technician','unemployed','unknown')|  
|marital|categorical,nominal|marital status ('divorced','married','single','unknown'; note: 'divorced' means divorced or widowed)|  
|education|categorical,nominal| ('basic.4y','basic.6y','basic.9y','high.school','illiterate','professional.course','university.degree','unknown') | 
|default|categorical,nominal| has credit in default? ('no','yes','unknown')|  
|housing|categorical,nominal| has housing loan? ('no','yes','unknown')|  
|loan|categorical,nominal| has personal loan? ('no','yes','unknown')|  
|contact|categorical,nominal| contact communication type ('cellular','telephone')|  
|month|categorical,ordinal| last contact month of year ('jan', 'feb', 'mar', ..., 'nov', 'dec')| 
|day_of_week|categorical,ordinal| last contact day of the week ('mon','tue','wed','thu','fri')|  
|duration|numeric| last contact duration, in seconds . Important note: this attribute highly affects the output target (e.g., if duration=0 then y='no')|
|campaign|numeric|number of contacts performed during this campaign and for this client (includes last contact)|  
|pdays|numeric| number of days that passed by after the client was last contacted from a previous campaign (999 means client was not previously contacted)|  
|previous|numeric| number of contacts performed before this campaign and for this client|  
|poutcome|categorical,nominal| outcome of the previous marketing campaign ('failure','nonexistent','success')|  
|emp.var.rate|numeric|employment variation rate - quarterly indicator|  
|cons.price.idx|numeric| consumer price index - monthly indicator|  
|cons.conf.idx|numeric| consumer confidence index - monthly indicator|  
|euribor3m|numeric|euribor 3 month rate - daily indicator|
|nr.employed|numeric| number of employees - quarterly indicator|   
|y | binary| has the client subscribed a term deposit? ('yes','no')|

## Read the data

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('bank.csv',delimiter=';')

In [3]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
age          4521 non-null int64
job          4521 non-null object
marital      4521 non-null object
education    4521 non-null object
default      4521 non-null object
balance      4521 non-null int64
housing      4521 non-null object
loan         4521 non-null object
contact      4521 non-null object
day          4521 non-null int64
month        4521 non-null object
duration     4521 non-null int64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4521 non-null object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

## Replace the `unknown` values with the `Nan` and check the value count of missing values and drop the missing rows

In [5]:
for i in df.columns:
    if any(df[i]=="unknown")== True:
        df[i].replace({"unknown":np.nan},inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\ops\__init__.py:1115: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

In [6]:
df.marital.value_counts()

married     2797
single      1196
divorced     528
Name: marital, dtype: int64

In [7]:
df.isna().sum()

age             0
job            38
marital         0
education     187
default         0
balance         0
housing         0
loan            0
contact      1324
day             0
month           0
duration        0
campaign        0
pdays           0
previous        0
poutcome     3705
y               0
dtype: int64

In [8]:
df_na_removed=df.dropna()

## Replace the column name from `loan` to `previous_loan_status` and `y` to `loan_status`

In [9]:
df_na_removed.rename(columns={"loan":"previous_loan_status","y":"loan_status"},inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4223: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(**kwargs)

In [10]:
df_na_removed.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'previous_loan_status', 'contact', 'day', 'month', 'duration',
       'campaign', 'pdays', 'previous', 'poutcome', 'loan_status'],
      dtype='object')

## Find out the information of the `job` column.

In [11]:
df_na_removed.job.describe()

count            764
unique            11
top       management
freq             177
Name: job, dtype: object

## Check the `loan_status`  approval rate by `job`

In [12]:
df_na_removed.groupby("job").loan_status.value_counts(normalize=True)*100

job            loan_status
admin.         no             75.490196
               yes            24.509804
blue-collar    no             88.111888
               yes            11.888112
entrepreneur   no             85.714286
               yes            14.285714
housemaid      no             70.588235
               yes            29.411765
management     no             73.446328
               yes            26.553672
retired        no             68.181818
               yes            31.818182
self-employed  no             84.615385
               yes            15.384615
services       no             75.862069
               yes            24.137931
student        no             57.894737
               yes            42.105263
technician     no             78.832117
               yes            21.167883
unemployed     no             75.000000
               yes            25.000000
Name: loan_status, dtype: float64

## Check the percentage of loan approved by `education`

In [13]:
df_na_removed[df_na_removed["loan_status"]=='yes'].groupby("education").loan_status.value_counts()/df_na_removed[df_na_removed["loan_status"]=='yes'].groupby("education").loan_status.value_counts().sum()

education  loan_status
primary    yes            0.087719
secondary  yes            0.502924
tertiary   yes            0.409357
Name: loan_status, dtype: float64

In [14]:
df_na_removed.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'previous_loan_status', 'contact', 'day', 'month', 'duration',
       'campaign', 'pdays', 'previous', 'poutcome', 'loan_status'],
      dtype='object')

## Check the percentage of loan approved by `previous loan status`

In [15]:
df_na_removed.groupby("previous_loan_status").loan_status.value_counts(normalize=True)*100

previous_loan_status  loan_status
no                    no             76.339286
                      yes            23.660714
yes                   no             86.956522
                      yes            13.043478
Name: loan_status, dtype: float64

## Create a pivot table between `loan_status` and `marital ` with values form `age`

In [16]:
df_na_removed.pivot_table(index="loan_status",values='age',columns='marital',aggfunc=["count"])

               count
marital     divorced married single
loan_status
no                59     360    174
yes               21      96     54

## Loan status based on marital status whose status is married

In [17]:
df_na_removed.pivot_table(index="loan_status",values='age',columns='marital',aggfunc=["count"])

               count
marital     divorced married single
loan_status
no                59     360    174
yes               21      96     54

## Create a  Dataframes

In [30]:
# class 1
branch_1 = {
        'customer_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Andrew', 'Alex', 'Sabestian', 'Brain', 'Jack'], 
        'last_name': ['Ng', 'Hales', 'Rachaska', 'Alexander', 'Anthony']}
df_branch_1 = pd.DataFrame(branch_1, columns = ['customer_id', 'first_name', 'last_name'])
print(df_branch_1)

# class 2
branch_2 = {
        'customer_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Brain', 'Steve', 'Kim', 'Steve', 'Ben'], 
        'last_name': ['Alexander', 'Jobs', 'Jonas', 'Fleming', 'Richardsan']}
df_branch_2 = pd.DataFrame(branch_2, columns = ['customer_id', 'first_name', 'last_name'])
print(df_branch_2)

# test_score
credit_score = {
        'customer_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'score': [513, 675, 165, 961, 1080, 1654, 415, 900, 610, 1116]}
df_credit_score = pd.DataFrame(credit_score, columns = ['customer_id','score'])
print(df_credit_score)

  customer_id first_name  last_name
0           1     Andrew         Ng
1           2       Alex      Hales
2           3  Sabestian   Rachaska
3           4      Brain  Alexander
4           5       Jack    Anthony
  customer_id first_name   last_name
0           4      Brain   Alexander
1           5      Steve        Jobs
2           6        Kim       Jonas
3           7      Steve     Fleming
4           8        Ben  Richardsan
  customer_id  score
0           1    513
1           2    675
2           3    165
3           4    961
4           5   1080
5           7   1654
6           8    415
7           9    900
8          10    610
9          11   1116

## Concatenate the dataframe `df_branch_1` and `df_branch_2` along the rows

In [56]:
df_concat=pd.concat([df_branch_1,df_branch_2])

In [55]:
df_branch_1.set_index("customer_id")
df_branch_2.set_index("customer_id")

            first_name   last_name
customer_id
4                Brain   Alexander
5                Steve        Jobs
6                  Kim       Jonas
7                Steve     Fleming
8                  Ben  Richardsan

In [83]:
df_concat=pd.concat([df_branch_1,df_branch_2],axis=0)

In [77]:
pd.merge(pd.merge(df_branch_1,df_branch_2,on="customer_id",how="outer"),df_credit_score,on="customer_id",how="outer")

   customer_id first_name_x last_name_x first_name_y last_name_y   score
0            1       Andrew          Ng          NaN         NaN   513.0
1            2         Alex       Hales          NaN         NaN   675.0
2            3    Sabestian    Rachaska          NaN         NaN   165.0
3            4        Brain   Alexander        Brain   Alexander   961.0
4            5         Jack     Anthony        Steve        Jobs  1080.0
5            6          NaN         NaN          Kim       Jonas     NaN
6            7          NaN         NaN        Steve     Fleming  1654.0
7            8          NaN         NaN          Ben  Richardsan   415.0
8            9          NaN         NaN          NaN         NaN   900.0
9           10          NaN         NaN          NaN         NaN   610.0
10          11          NaN         NaN          NaN         NaN  1116.0

In [28]:
df_test["customer_id"]==4

0    False
1    False
2    False
3    False
4    False
Name: customer_id, dtype: bool

In [29]:
df_test[df_test["customer_id"]==4]

Empty DataFrame
Columns: [customer_id, first_name, last_name]
Index: []

In [81]:
df_credit_score

  customer_id  score
0           1    513
1           2    675
2           3    165
3           4    961
4           5   1080
5           7   1654
6           8    415
7           9    900
8          10    610
9          11   1116

In [82]:
df_concat

  customer_id first_name  last_name customer_id first_name   last_name
0           1     Andrew         Ng           4      Brain   Alexander
1           2       Alex      Hales           5      Steve        Jobs
2           3  Sabestian   Rachaska           6        Kim       Jonas
3           4      Brain  Alexander           7      Steve     Fleming
4           5       Jack    Anthony           8        Ben  Richardsan

## Merge two dataframes `df_new` and `df_credit_score` with both the left and right dataframes using the `customer_id` key

In [84]:
pd.merge(df_credit_score,df_concat,on="customer_id",how="inner")

  customer_id  score first_name   last_name
0           1    513     Andrew          Ng
1           2    675       Alex       Hales
2           3    165  Sabestian    Rachaska
3           4    961      Brain   Alexander
4           4    961      Brain   Alexander
5           5   1080       Jack     Anthony
6           5   1080      Steve        Jobs
7           7   1654      Steve     Fleming
8           8    415        Ben  Richardsan